app/controllers/order_uploads_controller.rb

  def index
    @order_uploads = OrderUpload.all
---
SELECT "order_uploads".* FROM "order_uploads"

  def create
    @order_upload = OrderUpload.new(order_upload_params)

    respond_to do |format|
      if @order_upload.save
---
INSERT INTO "order_uploads" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2023-05-31 16:10:21.925232"], ["updated_at", "2023-05-31 16:10:21.925232"]]

  def update
    respond_to do |format|
      if @order_upload.update(order_upload_params)
---
UPDATE "order_uploads" SET "updated_at" = ? WHERE "order_uploads"."id" = ?  [["updated_at", "2023-05-31 16:10:21.961608"], ["id", 4]]

    def set_order_upload
      @order_upload = OrderUpload.find(params[:id])
---
SELECT "order_uploads".* FROM "order_uploads" WHERE "order_uploads"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

    def create_records_from_file(file)
      # After upload, displays the total amount gross revenue represented by the uploaded file.
      @total = 0.0
      CSV.parse(file.download, headers: true, col_sep: "\t") do |row|
        OrderSummary.new(
          customer_name: row["purchaser name"],
          description: row["item description"],
          price: row["item price"].to_f,
          item_count: row["purchase count"].to_i,
          merchant_address: row["merchant address"],
          merchant_name: "merchant name").save!
---
INSERT INTO "order_summaries" ("customer_name", "description", "price", "item_count", "merchant_address", "merchant_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)