app/controllers/order_summaries_controller.rb

  def index
    @order_summaries = OrderSummary.all
---
SELECT "order_summaries".* FROM "order_summaries"

  def create
    @order_summary = OrderSummary.new(order_summary_params)

    respond_to do |format|
      if @order_summary.save
---
INSERT INTO "order_summaries" ("customer_name", "description", "price", "item_count", "merchant_address", "merchant_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_order_summary
      @order_summary = OrderSummary.find(params[:id])
---
SELECT "order_summaries".* FROM "order_summaries" WHERE "order_summaries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]